﻿// answers
"Yes" = "Yes";
"No" = "No";
"Cancel" = "Cancel";
"OK" = "OK";
"Error" = "Error";
"Warning" = "Warning";
"Info" = "Info";
"Quit" = "Quit";
"Try" = "Try";
"Unchanged" = "Unchanged";
"Changed" = "Changed";
"Encrypted" = "Encrypted";
"Decrypted" = "Decrypted";
"Unknown" = "Unknown";
"Unregistered" = "Unregistered";
"Imported" = "Imported";
"Link" = "Link";
"External" = "External";
"Internal" = "Internal";
"DATASTORE" = "DATEN";
"TEMPLATES" = "VORLAGEN";
"IMPORTS" = "IMPORTS";
"Image" = "Image";
"File" = "File";

// alert
"CorrectSerialNumberThanks" = "Correct serial number, thank you for purchase.";
"WrongSerialNumber" = "Unrecognized serial number.";
"PleaseInsertNameAndSerNum" = "Please enter your name and your serial number to register.";
"UnableToCreateAppSupportFolder" = "Unable to create a folder in Application Support! Cannot proceed!";
"UnableToFindAppSupportFolder" = "Unable to find Application Support folder on your System! Cannot proceed!";
"UnableToDetermineDatabaseFile" = "Unable to determine database file of application! Cannot Proceed!";
"UnableToInitializeDB" = "Unable to initialize database! Cannot proceed!";
"UnableToInitializeDBTables" = "Unable to initialize database tables! Cannot proceed!";
"UnableToReadDBData" = "Unable to read database data! Cannot proceed!";
"DBInitError" = "On initializing your database has an error occured! Cannot proceed!";
"DBInitTablesError" = "On initializing the database tables has an error occured! Cannot proceed!";
"DBCheckVersionError" = "On reading the db version from database has an error occured! Cannot proceed!";
"DBCheckRegError" = "On reading and checking the registration an error has occured! Cannot proceed!";
"OSTooOld" = "You System version is not supported anymore. The application might not behave as expected! Please upgrade!";
"UnableToMakeBackupOfDB" = "A backup of your database could not be made, please consult the support! Do you want to proceed?";
"ErrorCreatingTmpFolder" = "Some Application resources could not be set up, application will shut down. Please contact support!";
"WrongDecryptionPasswordTitle" = "Wrong Password for decryption!";
"WrongDecryptionPasswordMsgForMoreItemsToCome" = "The password you provided for decryption is wrong. Do you want to proceed decrypting?";
"WrongDecryptionPasswordMsgForNoMoreItemsToCome" = "The password you provided for decryption is wrong. Please retry with the correct password.";
"EncryptionFailureTitle" = "Encryption error!";
"EncryptionFailureMsg" = "Error on encrypting one or more Values!";
"DecryptionFailureTitle" = "Decryption error!";
"DecryptionFailureMsg" = "Error on decrypting one or more Values!";
"DecryptingOnlyOneItemValueTitle" = "Decrypting Info";
"DecryptingOnlyOneItemValueMsg" = "You can decrypt only one Value at a time.";
"EncryptingOnlyOneItemValueTitle" = "Encrypting Info";
"EncryptingOnlyOneItemValueMsg" = "You can encrypt only one Value at a time.";
"NoDefaultEncryptPWSetTitle" = "No default password";
"NoDefaultEncryptPWSetMsg" = "There is no default password for encryption. Please set one in Preferences.";
"BetaTestPhaseExpiredTitle" = "Beta Version Expired";
"BetaTestPhaseExpiredMsg" = "The beta test phase of this version of software has expired. Try getting a new version from\nhttp://www.software-by-mabe.com ";
"PbCopySizeToLargeTitle" = "Too large data size for copy";
"PbCopySizeToLargeMsg" = "The data size to copy to pasteboard is too large.\nTry copy less Items/Values or use Drag&Drop instead.";
"ImportInProgressTitle" = "Import in progress";
"ImportInProgressMsg" = "A data import is currently in progress. Please wait until it has finished.";
"ExportInProgressTitle" = "Export in progress";
"ExportInProgressMsg" = "A data export is currently in progress. Please wait until it has finished.";
"ExternalDataReallyEncryptTitel" = "Encrypt external data?";
"ExternalDataReallyEncryptMsg" = "This Value has external data. Do you really want to encrypt and override it?";
"FeatureDeactivatedInDemoTitle" = "Demo mode";
"FeatureDeactivatedInDemoMsg" = "This feature is not available in Demo mode!";
"UnableToSaveDataTitle" = "Could not save data!";
"UnableToSaveDataMsg" = "Could not save data to the specified target!";
"CannotAddToItemRefWithoutTargetTitle" = "Item link without target";
"CannotAddToItemRefWithoutTargetMsg" = "You cannot add data to a Item link that does not have a target!";
"CannotImportToItemRefWithoutTargetTitle" = "Item link without target";
"CannotImportToItemRefWithoutTargetMsg" = "You cannot import to a Item link that does not have a target!";
"CannotPasteToItemRefWithoutTargetTitle" = "Item link without target";
"CannotPasteToItemRefWithoutTargetMsg" = "You cannot paste to a Item link that does not have a target!";
"MoreItemsSelectedForReferencingTitle" = "Multiple selection";
"MoreItemsSelectedForReferencingMsg" = "Do you really want to create a reference of each selection?";
"NoSelectionTitle" = "No selection";
"NoSelectionMsg" = "Please select some Items or Values first";
"ReferenceNotInSameSubtreeTitle" = "Reference target in subtree";
"ReferenceNotInSameSubtreeMsg" = "Reference targets in the same subtree are not allowed because this would result in circles!";
"UpdateSiteUnavailableTitle" = "Updatesite unavailable";
"UpdateSiteUnavailableMsg" = "The updatesite is currently unavailable. Please retry again later.";

// alerts adding, deleting elements and attributes
"CannotAddItemValueNoSelectedItem" = "No Item is selected to where the Value can be added. Select an element first!";
"CannotDelItemValueNoSelectedItemValue" = "No Value is selected. Please select an Value to delete.";
"CannotDelCurrentSelection" = "Nothing is selected. Cannot delete!";
"NoURL" = "Your input is no valid URL!";
"NoValidURL" = "This URL cannot be connected!";
"CouldNotLoadFromLink" = "Could not load data from specified link! You should check if this link exists.";
"NoRegularFile" = "Only regular file, no directories or symlinks can be imported!";

// status messages
"ItemViewUpdated" = "Item list updated!";
"ItemValueListViewUpdated" = "Value details updated!";
"NewItemAdded" = "New Item added to list!";
"NewItemValueAdded" = "New Value added to list!";
"ItemDeleted" = "Item and all subelements removed from list!";
"UnableToCheckUpdate" = "Updates could not be checked!";
"TrialDaysLeft" = "Days left for evaluation: ";
"TrialPeriodExpired" = "Sorry your trial period has expired. If you like this program please buy it.";
"DisplayingXValuesOutOfY" = "Displaying %d values out of %d";

// progress sheet action messages
"SavingTextEditorData" = "Saving Text";
"Importing..." = "Importing...";
"Exporting..." = "Exporting...";
"Pasting..." = "Pasting...";

// Growl messages
"AlarmGrowlTitle" = "Date reminder!";
"AlarmGrowlDescriptionOne" = "One date reminder";
"AlarmGrowlDescriptionMore" = "%i date reminders";

// Toolbar stuff
"NavigationItemLabel" = "Navigation";
"NavigationItemPalette" = "Item Navigation";
"NavigationItemTooltip" = "Item Forward/Backward Navigation";
"DeleteItemLabel" = "Delete";
"DeleteItemPalette" = "Delete Item";
"DeleteItemTooltip" = "Delete current selected Item";
"AddItemLabel" = "Add Item";
"AddItemPalette" = "Add Item";
"AddItemTooltip" = "Add a new Item";
"AddNormalItemLabel" = "Add Normal Item";
"AddNormalItemPalette" = "Add Normal Item";
"AddNormalItemTooltip" = "Add a new Item";
"AddTableItemLabel" = "Add Table Item";
"AddTableItemPalette" = "Add Table Item";
"AddTableItemTooltip" = "Add a new Table Item";
"AddTemplateItemLabel" = "Add Template Item";
"AddTemplateItemPalette" = "Add Template Item";
"AddTemplateItemTooltip" = "Add a new Template Item";
"AddContactItemLabel" = "Add Contact Item";
"AddContactItemPalette" = "Add Contact Item";
"AddContactItemTooltip" = "Add a new Contact Item";
"AddItemValueItemLabel" = "Add Value";
"AddItemValueItemPalette" = "Add Value";
"AddItemValueItemTooltip" = "Add a new Value to the current Item";
"AddSimpleTextItemValueLabel" = "Add Text Value";
"AddSimpleTextItemValuePalette" = "Add Simple Text Value";
"AddSimpleTextItemValueTooltip" = "Add a new Text Value to the current Item";
"AddExtendedTextItemValueLabel" = "Add Rich Text Value";
"AddExtendedTextItemValuePalette" = "Add Rich Text Value";
"AddExtendedTextItemValueTooltip" = "Add a new Rich Text Value to the current Item";
"AddNumberItemValueLabel" = "Add Number Value";
"AddNumberItemValuePalette" = "Add Number Value";
"AddNumberItemValueTooltip" = "Add a new Number Value to the current Item";
"AddCurrencyItemValueLabel" = "Add Currency Value";
"AddCurrencyItemValuePalette" = "Add Currency Value";
"AddCurrencyItemValueTooltip" = "Add a new Currency Value to the current Item";
"AddBoolItemValueLabel" = "Add Bool Value";
"AddBoolItemValuePalette" = "Add Bool Value";
"AddBoolItemValueTooltip" = "Add a new Bool Value to the current Item";
"AddDateItemValueLabel" = "Add Date Value";
"AddDateItemValuePalette" = "Add Date Value";
"AddDateItemValueTooltip" = "Add a new Date Value to the current Item";
"AddURLItemValueLabel" = "Add URL Value";
"AddURLItemValuePalette" = "Add URL Value";
"AddURLItemValueTooltip" = "Add a new URL Value to the current Item";
"AddFileItemValueLabel" = "Add File Value";
"AddFileItemValuePalette" = "Add File Value";
"AddFileItemValueTooltip" = "Add a new File Value to the current Item";
"AddImageItemValueLabel" = "Add Image Value";
"AddImageItemValuePalette" = "Add Image Value";
"AddImageItemValueTooltip" = "Add a new Image Value to the current Item";
"AddPDFItemValueLabel" = "Add PDF Value";
"AddPDFItemValuePalette" = "Add PDF Value";
"AddPDFItemValueTooltip" = "Add a new PDF Value to the current Item";
"MainViewAlignmentItemLabel" = "Alignment";
"MainViewAlignmentItemPalette" = "Main View Alignment";
"MainViewAlignmentItemTooltip" = "Switch Main View Alignment";
"ViewKindSegmentItemLabel" = "View";
"ViewKindSegmentItemPalette" = "View";
"ViewKindSegmentItemTooltip" = "Switch View";
"InfoItemLabel" = "Information";
"InfoItemPalette" = "Information";
"InfoItemTooltip" = "Information";
"PrefsItemLabel" = "Preferences";
"PrefsItemPalette" = "Preferences";
"PrefsItemTooltip" = "Preferences";
"UpItemLabel" = "Up";
"UpItemPalette" = "View up";
"UpItemTooltip" = "Make upper view smaller";
"DownItemLabel" = "Down";
"DownItemPalette" = "View down";
"DownItemTooltip" = "Make upper view larger";
"SearchItemLabel" = "Search";
"SearchItemPalette" = "Search";
"SearchItemTooltip" = "Search for Items or Values";

// Preferences Toolbar
"GeneralPrefsItemLabel" = "General";
"GeneralPrefsItemPalette" = "General";
"GeneralPrefsItemTooltip" = "General";
"BackupPrefsItemLabel" = "Backup";
"BackupPrefsItemPalette" = "Backup";
"BackupPrefsItemTooltip" = "Backup";
"FormatPrefsItemLabel" = "Format";
"FormatPrefsItemPalette" = "Format";
"FormatPrefsItemTooltip" = "Format";
"ImExportPrefsItemLabel" = "ImExport";
"ImExportPrefsItemPalette" = "ImExport";
"ImExportPrefsItemTooltip" = "ImExport";
"ExternalsPrefsItemLabel" = "Externals";
"ExternalsPrefsItemPalette" = "Externals";
"ExternalsPrefsItemTooltip" = "Externals";
"PrivacyPrefsItemLabel" = "Privacy";
"PrivacyPrefsItemPalette" = "Privacy";
"PrivacyPrefsItemTooltip" = "Privacy";

// defaults for creating new items or itemvalues
"NewStdItem" = "New Item";
"NewItemValue" = "New Value";

// item stuff
"StdItemName" = "Item";
"TableItemName" = "Table Item";
"RootContactItemName" = "Contacts";
"ContactItemName" = "Contact";
"RootTemplateItemName" = "Templates";
"TemplateItemName" = "Template";
"TrashcanItemName" = "Trashcan";
"ItemRefName" = "Item Alias";

// itemvalue stuff
"ItemValueName" = "Value";
"STextItemValueName" = "Text";
"ETextItemValueName" = "Rich Text";
"NumberItemValueName" = "Number";
"CurrencyItemValueName" = "Currency";
"BoolItemValueName" = "Bool";
"DateItemValueName" = "Date";
"URLItemValueName" = "URL";
"FileItemValueName" = "File";
"ImageItemValueName" = "Image";
"PDFItemValueName" = "PDF";
"ItemValueRefName" = "Value Alias";

// tableView and outlineView stuff
"PrefixForCombinedItemAndItemValueList" = "Item";
"SystemPrefixForCompinedItemAndItemValueList" = "System Item";

// Formatter stuff
"NumberDefaultFormatString" = "0.00;0.00;-0.00";
"CurrencyDefaultFormatString" = "$ #,##0.00;$ 0.00;[Red]($ #,##0.00)";
"DateDefaultFormatString" = "%A, %B %e, %Y %H:%M";

// undo manager stuff
"UndoAddItem" = "Add Item";
"UndoAddItemValue" = "Add Value";
"UndoDelItem" = "Delete Item";
"UndoDelItemValue" = "Delete Value";
"UndoChangeItemName" = "Change Item name";
"UndoChangeItemComment" = "Change Item comment";
"UndoChangeItemSortorder" = "Move Item";
"UndoChangeItemValueName" = "Change Value name";
"UndoChangeItemValueComment" = "Change Value comment";
"UndoChangeItemValueValue" = "Change Value value";
"UndoChangeItemValueSortorder" = "Change Value sortorder";
"UndoChangeValueData" = "Change Value";
"UndoChangeValueFormatterString" = "Change Value format";
"UndoChangeValueUseGlobalFormat" = "Change Value format setting";
"UndoChangeValueType" = "Change Value type";

// confirmations
"TrashcanDeleteTitle" = "Emptying trashcan...";
"TrashcanDeleteConfirm" = "Really empty trashcan? Data cannot be recovered!";
"ReduceETextValueTypeTitle" = "Changing text type";
"ReduceETextValueTypeConfirm" = "Really change text format? Switching may cause loss of information!";
"UnsavedTextDataTitle" = "Unsaved Text data";
"UnsavedTextDataMsg" = "Your text data has not been saved, do you want to save now?";
"SwitchToAutoLoadTitle" = "Activating autoload function";
"SwitchToAutoLoadConfirm" = "The Text has been changed, do you want to keep the text?";
"OverwriteDataTitle" = "Overwriting data";
"OverwriteDataConfirm" = "You have edited your data, do you want to save it and override the old data?";

// date format explanations
"%a" = "abbreviated weekday name";
"%A" = "full weekday name";
"%b" = "abbreviated month name";
"%B" = "full month name";
"%c" = "shorthand for %X %x, the locale format for date and time";
"%d" = "day of the month as a decimal number (01-31)";
"%e" = "same as %d but does not print the leading 0 for days 1 through 9";
"%F" = "milliseconds as a decimal number (000-999)";
"%H" = "hour based on a 24-hour clock as a decimal number (00-23)";
"%I" = "hour based on a 12-hour clock as a decimal number (01-12)";
"%j" = "day of the year as a decimal number (001-366)";
"%m" = "month as a decimal number (01-12)";
"%M" = "minute as a decimal number (00-59)";
"%p" = "AM/PM designation for the locale";
"%S" = "second as a decimal number (00-59)";
"%w" = "weekday as a decimal number (0-6), where Sunday is 0";
"%x" = "date using the date representation for the locale";
"%X" = "time using the time representation for the locale";
"%y" = "year without century (00-99)";
"%Y" = "year with century (such as 1990)";
"%Z" = "time zone name (such as Pacific Daylight Time)";
"%z" = "time zone offset in hours and minutes from GMT (HHMM)";